/*
Составьте программу, которая принимает с клавиатуры целое число и, если оно соответствует оценке ученика, выводит
на экран соответствующую «текстовую форму оценки» 
(1 или 2 – «неудовлетворительно», 3 – «удовлетворительно», 4 – «хорошо», 5 – «отлично»). В случае, 
если число не является оценкой, следует вывести на экран соответствующее текстовое сообщение.
ввод: 5 ⇒ вывод: отлично; ввод: 6 ⇒ вывод: это не оценка)
*/

let number = +prompt("Введите оценке:" , "3")
let result = (count) => {
    switch(count){
        case 1:
        case 2:
            document.write("неудовлетворительно")
            break;
        case 3:
            document.write("удовлетворительно")
            break;
        case 4:
            document.write("хорошо")
            break;
        case 5:
            document.write("отлично")
            break;
        default:
            document.write("это не оценка")
    }
}
result(number)